## Plan Result (sbox-apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 5 to change, 1 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_role_assignment.apim
* Update
  * module.api-mgmt.azurerm_api_management.apim
  * module.api-mgmt.azurerm_application_insights.apim
  * module.api-mgmt.azurerm_network_security_group.apim
  * module.api-mgmt.azurerm_public_ip.apim
  * module.api-mgmt.azurerm_route_table.route_table
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "cft-api-mgmt-sbox"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "cft-sbox-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tags                      = (known after apply)
      + tenant_access             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-sbox"
        name                          = "cft-api-mgmt-sbox"
      ~ tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "false"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "Sandbox"
          - "expiresAfter" = "2023-01-18"
        } -> (known after apply)
        # (20 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-sbox" -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-sbox/customDomains/default" -> (known after apply)

      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_application_insights.apim will be updated in-place
  ~ resource "azurerm_application_insights" "apim" {
        id                                    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-sbox"
        name                                  = "cft-api-mgmt-sbox"
      ~ tags                                  = {
          - "application"  = "core"
          - "autoShutdown" = "false"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "Sandbox"
          - "expiresAfter" = "2023-01-18"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_network_security_group.apim will be updated in-place
  ~ resource "azurerm_network_security_group" "apim" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/networkSecurityGroups/cft-api-mgmt-sbox-nsg"
        name                = "cft-api-mgmt-sbox-nsg"
      ~ tags                = {
          - "application"  = "core"
          - "autoShutdown" = "false"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "Sandbox"
          - "expiresAfter" = "2023-01-18"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_public_ip.apim will be updated in-place
  ~ resource "azurerm_public_ip" "apim" {
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-api-mgmt-sbox-private-pip"
        name                    = "cft-api-mgmt-sbox-private-pip"
      ~ tags                    = {
          - "application"  = "core"
          - "autoShutdown" = "false"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "Sandbox"
          - "expiresAfter" = "2023-01-18"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_role_assignment.apim will be created
  + resource "azurerm_role_assignment" "apim" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.api-mgmt.azurerm_route_table.route_table will be updated in-place
  ~ resource "azurerm_route_table" "route_table" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/routeTables/cft-api-mgmt-sbox-route-table"
        name                          = "cft-api-mgmt-sbox-route-table"
      ~ tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "false"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "Sandbox"
          - "expiresAfter" = "2023-01-18"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1389,"Program":"tfcmt","SHA1":"","Target":"sbox-apim","Vars":{}} -->